// Дана последовательность температурных колебаний: -25.4, -27.0 13.0, 19.0, 15.5, 24.5, -21.0, 32.5
// Объединить данные значения в группы с шагом в 10 градусов
// Последовательность в подмножноствах не важна.
// Пример: -20:{-25.4, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc

package main

import "fmt"

func createGroups(sequence []float64) map[int][]float64 {

	result := make(map[int][]float64)

	for _, v := range sequence { // проходим по последовательности температурных значений

		key := int(v) / 10 * 10 // отсекаем хвост float и меняем его на 0

		if i, ok := result[key]; ok == true { // если такой ключ уже есть, добавляем в слайс
			result[key] = append(i, v)

		} else {
			result[key] = []float64{v} // если нет, присваиваем значению мапы слайс с единственным температурным значением
		}
	}

	return result
}

func main() {

	sequence := []float64{-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5}

	fmt.Println(createGroups(sequence))

}
