// Дана последовательность чисел: 2,4,6,8,10
// Найти сумму их квадратов(22+32+42….) с использованием конкурентных вычислений.
package main

import (
	"fmt"
	"sync"
)

func main() {
	array := []int{2, 4, 6, 8, 10} // инициализируем исходный cлайс чисел

	result := 0 // инициализируем переменную с итоговым результатом

	wg := new(sync.WaitGroup) // создаем вэйтгруппу для синхронизации горутин

	var mutex sync.Mutex // создаем мьютекс для защиты от одновременного обращения к переменной

	for i, v := range array {

		wg.Add(1) // увеличиваем внутренний счетчик вэйтгруппы за каждую запущенную горутину
		go func(v int, i int) {

			mutex.Lock() // закрываем доступ другим горутинам к переменной
			result += v * v
			mutex.Unlock() // после записи открываем доступ другим горутинам

			wg.Done() // говорим что горутина завершила работу
		}(v, i)

	}

	wg.Wait() // ждем завершения работы всех горутин

	fmt.Println(result)

}
