// Написать программу, которая конкурентно рассчитает значение квадратов чисел
// Взятых из массива (2,4,6,8,10) и выведет их квадраты в stdout.
package main

import (
	"fmt"
	"sync"
)

func main() {

	array := []int{2, 4, 6, 8, 10} // инициализируем исходный cлайс чисел

	result := make([]int, len(array), len(array)) // создаем слайс той же длины и вместимости

	wg := new(sync.WaitGroup) // создаем вэйтгруппу для синхронизации горутин

	for i, v := range array {

		wg.Add(1) // увеличиваем внутренний счетчик вэйтгруппы за каждую запущенную горутину

		go func(v int, i int) {
			result[i] = v * v
			wg.Done() // говорим что горутина завершила работу
		}(v, i)

	}

	wg.Wait() // ждем завершения работы всех горутин

	fmt.Println(array)
	fmt.Println(result)
}
